{
  "published_articles": "Artigos publicados",
  "academic_contributions": "Contribuições acadêmicas",
  "large_scale_dataset": "Large-scale dataset and benchmarking for hand and face detection focused on sign language",
  "large_scale_dataset_description": "A detecção de objetos é uma técnica de pré-processamento importante para o reconhecimento de língua de sinais, permitindo o foco nas partes mais importantes da imagem. Este artigo apresenta um novo conjunto de dados em larga escala para detecção de mãos e rosto no contexto da língua de sinais, mitigando a falta de dados para este problema. Avaliamos diferentes arquiteturas de detecção de objetos para encontrar o melhor equilíbrio entre custo computacional e precisão média (mAP). O conjunto de dados proposto contém 477.480 imagens anotadas. O detector mais preciso (CenterNet) alcançou um mAP de 96,7%. Além disso, as otimizações feitas nos modelos reduziram o tempo de inferência em até 74% no melhor cenário.",
  "sign_language_recognition": "Reconhecimento de palavras em língua de sinais baseado em aprendizado profundo e descritores handcrafted de baixo custo",
  "sign_language_recognition_description": "Diversas técnicas de aprendizado profundo e visão computacional têm sido utilizadas nos últimos anos para a criação de sistemas de reconhecimento e tradução de língua de sinais para a língua nativa a partir de vídeos, servindo como uma ferramenta de comunicação para os milhões de deficientes auditivos ao redor do mundo. Ainda assim, inúmeros fatores devem ser considerados para a criação de um sistema como esse, aumentando a complexidade da tarefa. Primeiramente, o treinamento de um modelo de classificação exige uma grande quantidade de dados, o que representa uma dificuldade visto que esta área sofre com a carência de bases de dados em larga escala disponíveis publicamente. Além disso, a fim de evitar a ambiguidade entre as palavras, é preciso considerar o maior número de parâmetros linguísticos possíveis na execução dos gestos que formam os sinais. Na prática, acrescenta-se ainda que o conjunto tecnológico adotado seja condizente com a realidade, evitando sensores custosos, intrusivos ou com baixa mobilidade...",
  "efficient_sign_language_recognition": "Sistema eficiente de reconhecimento de língua de sinais e método de criação de conjunto de dados baseado em aprendizado profundo e processamento de imagem",
  "efficient_sign_language_recognition_description": "Novas arquiteturas de aprendizado profundo são criadas todos os anos, alcançando resultados de ponta em reconhecimento de imagem e levando à crença de que, em alguns anos, tarefas complexas como a tradução de língua de sinais serão consideravelmente mais fáceis, servindo como uma ferramenta de comunicação para a comunidade de deficientes auditivos. Por outro lado, esses algoritmos ainda precisam de muitos dados para serem treinados e o processo de criação de conjuntos de dados é caro, demorado e lento. Assim, este trabalho visa investigar técnicas de processamento de imagem digital e aprendizado de máquina que podem ser usadas para criar um conjunto de dados de língua de sinais de forma eficaz. Discutimos sobre aquisição de dados, como a taxa de quadros por segundo para capturar ou subamostrar os vídeos, o tipo de fundo, pré-processamento e aumento de dados, usando redes neurais convolucionais e detecção de objetos para criar um classificador de imagens e comparando os resultados com base em testes estatísticos. Diferentes conjuntos de dados foram criados para testar as hipóteses, contendo 14 palavras usadas diariamente e gravadas por diferentes smartphones no sistema de cores RGB. Conseguimos...",
  "ai_for_detection": "Inteligência artificial para detecção e quantificação de ferrugem e bicho-mineiro em lavoura de café",
  "ai_for_detection_description": "O controle de pragas e doenças desempenha um papel fundamental na agricultura, pois os danos causados por esses agentes são responsáveis por uma enorme perda econômica todos os anos. Com base nessa premissa, criamos um algoritmo capaz de detectar ferrugem (Hemileia vastatrix) e bicho-mineiro (Leucoptera coffeella) em folhas de café (Coffea arabica) e quantificar a severidade da doença usando um aplicativo móvel como interface de alto nível para as inferências do modelo. Usamos diferentes arquiteturas de redes neurais convolucionais para criar o detector de objetos, além da biblioteca OpenCV, k-means e três tratamentos: o RGB e o valor para quantificação, e o software AFSoft, além da análise de variância, onde comparamos os três métodos. Os resultados mostram uma precisão média de 81,5% na detecção e que não houve diferença estatística significativa entre os tratamentos para quantificar a severidade das folhas de café, propondo um método computacionalmente menos custoso. O aplicativo, juntamente com o modelo treinado, pode detectar a praga e a doença em diferentes condições de imagem e estágios de infecção e também estimar o estágio de infecção da doença."
}
