{
  "my_resume": "Meu currículo",
  "professional_experience": "EXPERIÊNCIA PROFISSIONAL",
  "data_engineer": "Engenheiro de Dados",
  "banco_master": "Banco Master",
  "banco_master_description": "Atuar na transformação data driven da empresa através da implementação de projetos de dados de alto impacto. Os principais projetos são: - Implementação do datalake corporativo na Google Cloud Platform (GCP), utilizando diversas tecnologias para processamento e armazenamento de dados, como Dataflow, Dataproc, Cloud Storage, Apache Beam e Spark, além do Apache Airflow para operacionalizar os fluxos de tarefas. - Desenvolvimento de uma série de microsserviços utilizados nos motores de decisão de crédito da FICO, garantindo alta disponibilidade e escalabilidade para o ambiente. - Criação, implantação e treinamento de um novo sistema de gestão e unificação de listas restritivas a nível corporativo. - Criação de uma pipeline ETL para processamento e aplicação de regras de crédito, substituindo o trabalho manual e tornando o processo de crédito consignado em batch dezenas de vezes mais rápido.",
  "machine_learning_engineer": "Engenheiro de Machine Learning",
  "agibank": "Agibank",
  "agibank_description": "Como o primeiro analista do time de aprendizado de máquina, tive a responsabilidade de desenvolver, melhorar e operacionalizar diversos produtos de dados da companhia, voltados para agilizar e viabilizar a produtização de modelos em larga escala para mais de 3 milhões de clientes ativos. Os principais projetos desenvolvidos foram: - Criação e disponibilização de uma Feature Store baseada em tecnologias Cloud (Amazon Sagemaker), permitindo o wrangning de dados através de pipelines de ETL, além da disponibilização das features de forma online e com alto desempenho. - Criação de uma Model Development Platform (MDP), auxiliando os cientistas de dados na criação de novos modelos estatísticos e no descobrimento de features relevantes para melhorar as métricas dos classificadores. - Criação de sistema de detecção de objetos, rastreamento de indivíduos e reconhecimento facial para controle de segurança e contagem populacional. - Desenvolvimento de uma plataforma de streaming para envio de notificações (sms, push, e-mail) para determinados clientes.",
  "product_owner": "Product Owner",
  "nk_sistemas": "NK Sistemas de Informação de Saúde",
  "nk_sistemas_description": "Atuar no desenvolvimento e evolução dos projetos de software na área da saúde, garantindo o alinhamento do time técnico e a gestão dos clientes. Principais atividades: - Entender as demandas de clientes e stakeholders, realizando um roadmap consistente e com prioridades definidas; - Formação e manutenção do product backlog, épicos e sprints de modo que as atividades estejam claras para a equipe de desenvolvimento, estimulando a produtividade e entrega de valor; - Criação de requisitos funcionais e não funcionais do sistema com ferramentas do ecossistema Atlassian; - Implantação e condução de processos e metodologias como Design Thinking, Inception, Scrum e suas respectivas reuniões, e Feedback 360º; - Entendimento e benchmarking de produtos e serviços de mercado.",
  "full_stack_developer": "Desenvolvedor Full Stack",
  "nk_sistemas_description_2": "Atuar no desenvolvimento de softwares web e aplicativos multiplataforma na área da saúde. Com a responsabilidade de Full-Stack, atuei no front-end com os frameworks Angular e Ionic, na criação da API Restful utilizando NodeJS, na criação de fluxos de ETL com Python, e na modelagem dos bancos de dados SQL e NoSQL. Principais atividades: - Desenvolvimento de aplicativo para Android e iOS; - Desenvolvimento de sistema web com Angular; - Desenvolvimento de mockups, gráficos e dashboards; - Modelagem do banco de dados NoSQL; - Desenvolvimento de Web Crawlers com Scrapy; - Desenvolvimento de API em NodeJs. - Criação da pipeline ETL em Python para processar e disponibilizar os dados para análise.",
  "software_development_intern": "Estagiário de desenvolvimento de software",
  "nk_sistemas_description_3": "Atuar na migração de um sistema odontológico legado, criando uma nova plataforma voltada para saúde preventiva e gestão de clínicas. O projeto contou com a experiência de profissionais da área odontológica e de desenvolvimento de software. Principais atividades: - Desenvolvimento do sistema web com o Framework Angular; - Utilização de metodologias ágeis para gestão e organização do projeto; - Modelagem de banco de dados SQL e NoSQL; - Desenvolvimento de API Restful com NodeJS.",
  "education": "ESTUDOS",
  "master_computer_science": "Mestre em ciência da computação",
  "unesp": "Universidade Paulista Júlio Mesquita Filho (UNESP)",
  "unesp_description": "Mestrado acadêmico em ciência da computação, com ênfase em inteligência computacional. Título da dissertação: 'Reconhecimento de palavras em língua de sinais baseado em aprendizado profundo e descritores handcrafted de baixo custo'. As principais contribuições acadêmicas foram: - Criação de um novo conjunto de dados de larga escala para detecção de mãos e faces no contexto de linguagem de sinais. - Treinamento e otimização de diversos modelos de detecção de objetos para o contexto do projeto, reduzindo ao máximo o custo computacional. - Criação de uma pipeline de pré-processamento e amostragem de quadros para melhorar a eficiência do treinamento dos modelos. - Criação de um vetor de atributos simples e de baixo custo capaz de representar os parâmetros linguísticos de movimento e localização das mãos.",
  "technologist_big_data": "Tecnólogo em Big data no agronegócio",
  "fatec": "Faculdade Técnica Estadual (FATEC)",
  "fatec_description": "Tecnólogo com foco em dados e inteligência artificial. Além das matérias comuns de ciência da computação como lógica, matemática, redes e entre outras, essa graduação teve grande ênfase em temas relacionados a Big Data, como mineração de dados, aprendizado de máquina e computação em nuvem. Além disso, um aplicativo cross-platform com funcionalidade de identificar e quantificar doenças e pragas em folhas de café foi desenvolvido como Trabalho de Conclusão de Curso (TCC), utilizando tecnologias de deep learning para detecção de objetos e aprendizado de máquina para estimativa de severidade. Esse trabalho resultou em um registro de software, artigo científico e um projeto open-source de anotação semi-supervisionada de imagens para detecção de objetos.",
  "technical_informatics": "Técnico em informática",
  "etec": "Escola Técnica Estadual (ETEC)",
  "etec_description": "Curso técnico integrado ao ensino médio, possuindo uma grade ampla de matérias relacionadas à tecnologia da informação, como lógica de programação, banco de dados, redes, desenvolvimento web e entre outras. Trabalho de Conclusão de Curso (TCC) - Desenvolvimento de um sistema desktop para clínicas nutricionais, permitindo a criação de dietas, cadastro e anamnese de pacientes, cadastro de alimentos e etc."
}
