{
  "published_articles": "Published Articles",
  "academic_contributions": "Academic Contributions",
  "large_scale_dataset": "Large-scale dataset and benchmarking for hand and face detection focused on sign language",
  "large_scale_dataset_description": "Object detection is an important preprocessing technique for sign language recognition, allowing focus on the most important parts of the image. This paper introduces a new large-scale dataset for hand and face detection in sign language context, mitigating the lack of data for this problem. We evaluated different object detection architectures to find the best trade-off between computational cost and mean Average Precision (mAP). The proposed dataset contains 477,480 annotated images. The most accurate detector (CenterNet) achieved an mAP of 96.7%. Furthermore, the optimizations made to the models reduced the inference time up to 74% in the best scenario.",
  "sign_language_recognition": "Sign language recognition based on deep learning and low-cost handcrafted descriptors",
  "sign_language_recognition_description": "Various deep learning and computer vision techniques have been used in recent years to create systems for recognizing and translating sign language into native language from videos, serving as a communication tool for millions of hearing-impaired people around the world. However, numerous factors must be considered to create such a system, increasing the complexity of the task. Firstly, training a classification model requires a large amount of data, which is a challenge since this area suffers from a lack of large-scale publicly available datasets. Additionally, to avoid ambiguity between words, it is necessary to consider as many linguistic parameters as possible in the execution of gestures that form the signs. In practice, it is also important that the adopted technological set is consistent with reality, avoiding costly, intrusive, or low-mobility sensors...",
  "efficient_sign_language_recognition": "Efficient sign language recognition system and dataset creation method based on deep learning and image processing",
  "efficient_sign_language_recognition_description": "New deep-learning architectures are created every year, achieving state-of-the-art results in image recognition and leading to the belief that, in a few years, complex tasks such as sign language translation will be considerably easier, serving as a communication tool for the hearing-impaired community. On the other hand, these algorithms still need a lot of data to be trained and the dataset creation process is expensive, time-consuming, and slow. Thereby, this work aims to investigate techniques of digital image processing and machine learning that can be used to create a sign language dataset effectively. We argue about data acquisition, such as the frames per second rate to capture or subsample the videos, the background type, preprocessing, and data augmentation, using convolutional neural networks and object detection to create an image classifier and comparing the results based on statistical tests. Different datasets were created to test the hypotheses, containing 14 words used daily and recorded by different smartphones in the RGB color system. We achieved...",
  "ai_for_detection": "Artificial intelligence for detection and quantification of rust and leaf miner in coffee crop",
  "ai_for_detection_description": "Pest and disease control plays a key role in agriculture since the damage caused by these agents are responsible for a huge economic loss every year. Based on this assumption, we create an algorithm capable of detecting rust (Hemileia vastatrix) and leaf miner (Leucoptera coffeella) in coffee leaves (Coffea arabica) and quantify disease severity using a mobile application as a high-level interface for the model inferences. We used different convolutional neural network architectures to create the object detector, besides the OpenCV library, k-means, and three treatments: the RGB and value to quantification, and the AFSoft software, in addition to the analysis of variance, where we compare the three methods. The results show an average precision of 81, 5% in the detection and that there was no significant statistical difference between treatments to quantify the severity of coffee leaves, proposing a computationally less costly method. The application, together with the trained model, can detect the pest and disease over different image conditions and infection stages and also estimate the disease infection stage."
}
