{
  "my_resume": "My Resume",
  "professional_experience": "PROFESSIONAL EXPERIENCE",
  "data_engineer": "Data Engineer",
  "banco_master": "Banco Master",
  "banco_master_description": "Act in the company's data-driven transformation through the implementation of high-impact data projects. The main projects are: - Implementation of the corporate datalake on Google Cloud Platform (GCP), using various technologies for data processing and storage, such as Dataflow, Dataproc, Cloud Storage, Apache Beam, and Spark, as well as Apache Airflow to operationalize task flows. - Development of a series of microservices used in FICO's credit decision engines, ensuring high availability and scalability for the environment. - Creation, implementation, and training of a new system for managing and unifying restrictive lists at the corporate level. - Creation of an ETL pipeline for processing and applying credit rules, replacing manual work and making the batch payroll loan process dozens of times faster.",
  "machine_learning_engineer": "Machine Learning Engineer",
  "agibank": "Agibank",
  "agibank_description": "As the first analyst of the machine learning team, I was responsible for developing, improving, and operationalizing various data products of the company, aimed at speeding up and enabling the production of models on a large scale for over 3 million active customers. The main projects developed were: - Creation and availability of a Feature Store based on Cloud technologies (Amazon Sagemaker), allowing data wrangling through ETL pipelines, as well as the availability of features online and with high performance. - Creation of a Model Development Platform (MDP), assisting data scientists in creating new statistical models and discovering relevant features to improve classifier metrics. - Creation of an object detection system, individual tracking, and facial recognition for security control and population counting. - Development of a streaming platform for sending notifications (sms, push, email) to specific customers.",
  "product_owner": "Product Owner",
  "nk_sistemas": "NK Sistemas de Informação de Saúde",
  "nk_sistemas_description": "Act in the development and evolution of software projects in the health area, ensuring the alignment of the technical team and client management. Main activities: - Understand the demands of clients and stakeholders, creating a consistent roadmap with defined priorities; - Formation and maintenance of the product backlog, epics, and sprints so that activities are clear to the development team, stimulating productivity and value delivery; - Creation of functional and non-functional system requirements with Atlassian ecosystem tools; - Implementation and conduction of processes and methodologies such as Design Thinking, Inception, Scrum and their respective meetings, and 360º Feedback; - Understanding and benchmarking of market products and services.",
  "full_stack_developer": "Full Stack Developer",
  "nk_sistemas_description_2": "Act in the development of web software and cross-platform applications in the health area. With Full-Stack responsibility, I worked on the front-end with Angular and Ionic frameworks, creating the Restful API using NodeJS, creating ETL flows with Python, and modeling SQL and NoSQL databases. Main activities: - Development of an Android and iOS application; - Development of a web system with Angular; - Development of mockups, graphs, and dashboards; - Modeling of the NoSQL database; - Development of Web Crawlers with Scrapy; - Development of API in NodeJs. - Creation of the ETL pipeline in Python to process and make data available for analysis.",
  "software_development_intern": "Software Development Intern",
  "nk_sistemas_description_3": "Act in the migration of a legacy dental system, creating a new platform focused on preventive health and clinic management. The project involved the experience of professionals in the dental and software development areas. Main activities: - Development of the web system with the Angular Framework; - Use of agile methodologies for project management and organization; - Modeling of SQL and NoSQL databases; - Development of Restful API with NodeJS.",
  "education": "EDUCATION",
  "master_computer_science": "Master in Computer Science",
  "unesp": "Universidade Paulista Júlio Mesquita Filho (UNESP)",
  "unesp_description": "Academic master's degree in computer science, with an emphasis on computational intelligence. Dissertation title: 'Word recognition in sign language based on deep learning and low-cost handcrafted descriptors'. The main academic contributions were: - Creation of a new large-scale dataset for hand and face detection in the context of sign language. - Training and optimization of various object detection models for the project's context, minimizing computational cost. - Creation of a pre-processing and frame sampling pipeline to improve the efficiency of model training. - Creation of a simple and low-cost attribute vector capable of representing the linguistic parameters of hand movement and location.",
  "technologist_big_data": "Technologist in Big Data in Agribusiness",
  "fatec": "Faculdade Técnica Estadual (FATEC)",
  "fatec_description": "Technologist focused on data and artificial intelligence. In addition to common computer science subjects such as logic, mathematics, networks, and others, this degree had a strong emphasis on Big Data-related topics, such as data mining, machine learning, and cloud computing. Additionally, a cross-platform application with functionality to identify and quantify diseases and pests in coffee leaves was developed as a Course Completion Work (TCC), using deep learning technologies for object detection and machine learning for severity estimation. This work resulted in a software registration, scientific article, and an open-source project for semi-supervised image annotation for object detection.",
  "technical_informatics": "Technical in Informatics",
  "etec": "Escola Técnica Estadual (ETEC)",
  "etec_description": "Technical course integrated with high school, with a broad curriculum of information technology-related subjects, such as programming logic, databases, networks, web development, and others. Course Completion Work (TCC) - Development of a desktop system for nutritional clinics, allowing the creation of diets, registration and anamnesis of patients, food registration, etc."
}
